ContactsApp/app/controllers/api/contacts_controller.rb

INSERT INTO "contacts" ("first_name", "last_name", "phone_number", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "Bob"], ["last_name", "Stevens"], ["phone_number", 1], ["email", "bob@bobs.com"], ["created_at", "2019-07-11 02:49:26.427070"], ["updated_at", "2019-07-11 02:49:26.427070"]]
---
  def create
    @contact = Contact.create(
      first_name: params[:first_name],
      last_name: params[:last_name],
      phone_number: params[:phone_number],
      email: params[:email],
      user_id: current_user.id
    )

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @contact = Contact.find_by(id: params[:id])

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "contacts" SET "first_name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "contacts"."id" = $4  [["first_name", "Bran"], ["last_name", "Evans"], ["updated_at", "2019-07-13 19:48:53.833844"], ["id", 2]]
---
  def update
    @contact = Contact.find_by(id: params[:id])
    @contact.first_name = params[:first_name] || @contact.first_name
    @contact.last_name = params[:last_name] || @contact.last_name
    @contact.phone_number = params[:phone_number] || @contact.phone_number
    @contact.email = params[:email] || @contact.email
    @contact.save

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 4]]
---
  def delete
    @contact = Contact.find_by(id: params[:id])
    @contact.destroy